package main

/*

Нужно передать данные из некоторого источника некоторому потребителю.
При этом источник отдает данные небольшими пачками (~ десятки записей),
а потребитель оптимальнее работает с крупными батчами (~тысячи записей).

Реальный пример -  поставка данных из очередей типа Kafka  в базу Clickhouse.

Источник:
 - условно бесконечный
 - Источник никогда не возвращает более MaxItems записей за один вызов Next.
 - в рамках одной сессии  (одного вызова функции Pipe) источник каждый раз возвращает
 новые данные на каждый вызов Next.
 - Однако, после перезапуска источник начнет с прошлой "подтвержденной" позиции, задаваемой cookie.

Поэтому каждое значение cookie, которое вернул вызов Next, после сохранения данных в приемнике,
должно быть фиксировано вызовом Commit, причем строго в той же последовательности, в которой их вернул Next.


Приемник:
 - не может обработать более MaxItems за один раз

 Базовый уровень:
Требуется реализовать функцию func Pipe(p Producer, c Concumer) error, которая
читает данные из источника,
группирует их в буфер размером не более MaxItems
сохраняет в приемник,
после чего фиксирует прогресс в источнике

==================================

pending_cookies - список cookie, которые относятся к элементам, полностью лежащим в текущем big_batch.
Читаем пачку из Producer.
Если она целиком помещается в big_batch - добавляем, а её cookie кладем в pending_cookies.
Если она не помещается:
Дополняем big_batch до максимума.
Отправляем big_batch в Consumer.
Если успешно - коммитим все pending_cookies (они все гарантированно сохранены).
Очищаем big_batch и pending_cookies.
Оставшийся «хвост» кладем в новый big_batch.

Важно: cookie от этой пачки мы пока не коммитим, но так как хвост уже в новом big_batch,
мы сразу добавляем этот cookie в pending_cookies для нового батча.
Когда источник иссякнет, если остался непустой big_batch - отправляем его и коммитим оставшиеся pending_cookies.

*/

type Item int

type Producer interface {
}

//type Consumer interface {
//	consume() error
//}
//
//func (c Consumer) consume(bigBatch []Item) {
//	fmt.Println("consume big batch === ", c, bigBatch)
//}
