package main

func delInPlace(arr []int, pos int) []int {
	if pos < 0 || pos >= len(arr) || len(arr) == 0 {
		return arr
	}

	for i := pos; i < len(arr)-1; i++ {
		arr[i] = arr[i+1]
	}
	return arr[:len(arr)-1]
}

//arr := []int{1, 2, 3, 4, 5}
//fmt.Println(delInPlace(arr, 0))

/*

Дан слайс целых чисел values и целое число pos. Необходимо написать функцию removeElement,
которая удаляет элемент, стоящий на позиции pos. Функция должна модифицировать исходный слайс,
сохраняя порядок оставшихся элементов.

Если pos выходит за границы слайса (отрицательный или ≥ длины), необходимо вернуть
исходный слайс.

Пример 1:

Ввод: values = [1, 2, 3, 4, 5], pos = 1
Вывод: [1, 3, 4, 5]
Пример 2:

Ввод: values = [1, 2, 3, 4, 5], pos = 5
Вывод: [1, 2, 3, 4, 5]
*/
